In [1]:
import numpy as np
import pandas as pd

In [2]:
siblings = {
    "name" : ['Abc','Efg','Hij'],
    "marks": [42,33,17],
    "class": ["4th","2nd","6th"]
}

In [3]:
# DataFrame : 2-D, size-mutable, tabular data structure

df = pd.DataFrame(siblings)

print(df)

  name  marks class
0  Abc     42   4th
1  Efg     33   2nd
2  Hij     17   6th

In [4]:
# to_csv() : exports as .csv

df.to_csv('siblingsMarks')

In [5]:
# no index

df.to_csv('marks',index=False)

In [8]:
# first rows

df.head(2) # only first TWO rows

  name  marks class
0  Abc     42   4th
1  Efg     33   2nd

In [9]:
# last rows 

df.tail(2) # only last TWO rows

  name  marks class
1  Efg     33   2nd
2  Hij     17   6th

In [12]:
# count, mean, std., min, max ... (only for numerical value column)

df.describe()

           marks
count   3.000000
mean   30.666667
std    12.662280
min    17.000000
25%    25.000000
50%    33.000000
75%    37.500000
max    42.000000

In [14]:
# read from csv 

var = pd.read_csv('filename.csv')
var

   Train no.   From    To
0       11011    BLR  JNK
1       22333    KLG  UDP
2         100    PUN  KNK
3       67800    TMN  WSB
4       91432    MYR  DHL

In [21]:
# get ALL columns

var.columns

Index(['Train no. ', ' From ', ' To'], dtype='object')

In [30]:
# get ONE column

var[' From ']

0    BLR
1    KLG
2    PUN
3    TMN
4    MYR
Name:  From , dtype: object

In [31]:
# read one ROW [using index]

var[' From '][3]

'TMN'

In [43]:
# update single value 
# at[]
# loc[] : location

var.at[4,'Train no.'] = 99432

In [44]:
# save updated csv (same as export)

var.to_csv('Train_info.csv')

In [46]:
# change index

var.index = ['zero' , 'one' , 'two',3,4]